# checks if element in number list is also a member of gram list.
# if so, it returns the index of the member element in number list


def check_number(number, gram):
    x = 0
    for i in number:
        if i in gram:
            if x < number.index(i):
                x = number.index(i)
    return x
    pass


# returns 1 if elemens of number list represents person rather than number
def check_1_person(number, gram):
    x = 0
    for i in number:
        if i in gram:
            x = 1
    return x
    pass


# returns 2 if elemens of number list represents a couple of person rather than number
def check_2_person(number, gram):
    x = 0
    for i in number:
        if i in gram:
            x = 2
    return x
    pass


def find_number(gram):
    # the below list named as verbal_numberN can be omitted if one extra loop is used in the check
    # number method. just by checking element of gram and comparing string like done. just got the
    # idea and checked in CLI but i am too lazy too edit
    numeric_number = ['০', '১', '২', '৩', '৪', '৫', '৬', '৭', '৮', '৯', '১০', '১১', '১২', '১৩', '১৪', '১৫', '১৬', '১৭',
                      '১৮', '১৯', '২০', '২১', '২২', '২৩', '২৪', '২৫', '২৬', '২৭', '২৮', '২৯', '৩০', '৩১', '৩২', '৩৩',
                      '৩৪', '৩৫', '৩৬', '৩৭', '৩৮', '৩৯', '৪০', '৪১', '৪২', '৪৩', '৪৪', '৪৫', '৪৬', '৪৭', '৪৮', '৪৯']
    verbal_number = ['শূন্য', 'এক', 'দুই', 'তিন', 'চার', 'পাঁচ', 'ছয়', 'সাত', 'আট', 'নয়', 'দশ', 'এগার', 'বার', 'তের',
                     'চৌদ্দ', 'পনের', 'ষোল', 'সতের', 'আঠার', 'ঊনিশ', 'বিশ', 'একুশ', 'বাইশ', 'তেইশ', 'চব্বিশ', 'পঁচিশ',
                     'ছাব্বিশ', 'সাতাশ', 'আঠাশ', 'ঊনত্রিশ', ' ত্রিশ', 'একত্রিশ', 'বত্রিশ', 'তেত্রিশ', 'চৌত্রিশ',
                     'পঁয়ত্রিশ', 'ছত্রিশ', 'সাঁইত্রিশ', 'আটত্রিশ', 'ঊনচল্লিশ', ' চল্লিশ', 'একচল্লিশ', 'বিয়াল্লিশ',
                     'তেতাল্লিশ', 'চুয়াল্লিশ', 'পঁয়তাল্লিশ', 'ছেচল্লিশ', 'সাতচল্লিশ', 'আটচল্লিশ', 'ঊনপঞ্চাশ']
    verbal_number2 = ['শূন্য', 'একজনের', 'দুইজনের', 'তিনজনের', 'চারজনের', 'পাঁচজনের', 'ছয়জনের', 'সাতজনের', 'আটজনের',
                      'নয়জনের', 'দশজনের', 'এগারজনের', 'বারজনের', 'তেরজনের', 'চৌদ্দজনের', 'পনেরজনের', 'ষোলজনের',
                      'সতেরজনের', 'আঠারজনের', 'ঊনিশজনের', 'বিশজনের', 'একুশজনের', 'বাইশজনের', 'তেইশজনের', 'চব্বিশজনের',
                      'পঁচিশজনের', 'ছাব্বিশজনের', 'সাতাশজনের', 'আঠাশজনের', 'ঊনত্রিশজনের', ' ত্রিশজনের', 'একত্রিশজনের',
                      'বত্রিশজনের', 'তেত্রিশজনের', 'চৌত্রিশজনের', 'পঁয়ত্রিশজনের', 'ছত্রিশজনের', 'সাঁইত্রিশজনের',
                      'আটত্রিশজনের', 'ঊনচল্লিশজনের', ' চল্লিশজনের', 'একচল্লিশজনের', 'বিয়াল্লিশজনের', 'তেতাল্লিশজনের',
                      'চুয়াল্লিশজনের', 'পঁয়তাল্লিশজনের', 'ছেচল্লিশজনের', 'সাতচল্লিশজনের', 'আটচল্লিশজনের',
                      'ঊনপঞ্চাশজনের']
    verbal_number3 = ['শূন্য', 'একজনের', 'দুজনের', 'তিনজনের', 'চারজনের', 'পাঁচজনের', 'ছয়জনের', 'সাতজনের', 'আটজনের',
                      'নয়জনের', 'দশজনের', 'এগারজনের', 'বারজনের', 'তেরজনের', 'চৌদ্দজনের', 'পনেরজনের', 'ষোলজনের',
                      'সতেরজনের', 'আঠারজনের', 'ঊনিশজনের', 'বিশজনের']
    verbal_number4 = ['শূন্যজন', 'একজন', 'দুইজন', 'তিনজন', 'চারজন', 'পাঁচজন', 'ছয়জন', 'সাতজন', 'আটজন', 'নয়জন', 'দশজন',
                      'এগারজন', 'বারজন', 'তেরজন', 'চৌদ্দজন', 'পনেরজন', 'ষোলজন', 'সতেরজন', 'আঠারজন', 'ঊনিশজন', 'বিশজন',
                      'একুশজন', 'বাইশজন', 'তেইশজন', 'চব্বিশজন', 'পঁচিশজন', 'ছাব্বিশজন', 'সাতাশজন', 'আঠাশজন',
                      'ঊনত্রিশজন', ' ত্রিশজন', 'একত্রিশজন', 'বত্রিশজন', 'তেত্রিশজন', 'চৌত্রিশজন',
                      'পঁয়ত্রিশজন', 'ছত্রিশজন', 'সাঁইত্রিশজন', 'আটত্রিশজন', 'ঊনচল্লিশজন', ' চল্লিশজন', 'একচল্লিশজন',
                      'বিয়াল্লিশজন', 'তেতাল্লিশজন', 'চুয়াল্লিশজন', 'পঁয়তাল্লিশজন', 'ছেচল্লিশজন', 'সাতচল্লিশজন',
                      'আটচল্লিশজন', 'ঊনপঞ্চাশজন']

    taglist1 = ['সভাপতি', 'গৃহবধূ', 'শিশু', 'কৃষক', 'স্ত্রী', 'যুবক', 'ছাত্র', 'ছাত্রী', 'বিচারক']
    taglist2 = ['দম্পতি', 'দম্পতির', 'মা-মেয়ে', 'ভাই-বোন', 'মামা-ভাগ্নে', 'স্বামি-স্ত্রী', 'চাচি-ভাতিজির', 'বাবা-মেয়ের',
                'নানী-নাতি', 'বাবা-ছেলের', 'স্বামী-স্ত্রী']

    z = 0

    y = check_1_person(taglist1, gram)
    if y > z:
        z = y

    y = check_2_person(taglist2, gram)
    if y > z:
        z = y

    y = check_number(numeric_number, gram)
    if y > z:
        z = y

    y = check_number(verbal_number, gram)
    if y > z:
        z = y

    y = check_number(verbal_number2, gram)
    if y > z:
        z = y

    y = check_number(verbal_number3, gram)
    if y > z:
        z = y

    y = check_number(verbal_number4, gram)
    if y > z:
        z = y

    return z
